USAGE_PRIORITY_1 = {'учреждение', 'административное', 'детский сад', 'школа', 'торговое', 'магазин', 'столовая',
                    'павильон', 'лечебное', 'кафе', 'лаборатория', 'лабораторный корпус', 'поликлиника',
                    'торговый павильон', 'ясли-сад', 'административное здание', 'гостиница', 'лечебный корпус',
                    'больница', 'торговый центр', 'детское дошкольное учреждение', 'служебное', 'пожарное депо',
                    'институт', 'здание религиозных собраний', 'административный корпус', 'учебный корпус', 'клуб',
                    'выставочный павильон', 'колледж', 'спортивный комплекс', 'детская поликлиника', 'гимназия',
                    'библиотека'}

USAGE_PRIORITY_2 = {'производственное', 'мастерская', 'цех', 'производственный корпус', 'механические мастерские',
                    'лабораторно-производственный корпус', 'производственно-складское', 'столярная мастерская',
                    'производственное,учреждение', 'учреждение и производство', 'производственно-административное',
                    'ремонтный цех', 'производственное здание'}

USAGE_PRIORITY_3 = {'многоквартирный дом', 'индивидуальное жилое строение', 'жилой дом', 'общежитие', 'коттедж',
                    'интернат', 'жилое', 'жилое строение', 'блокированный жилой дом'}

WEATHER_CODE_MAPPING = {
    0: 'Ясно',
    1: 'В основном ясно',
    2: 'Переменная облачность',
    3: 'Пасмурно',
    71: 'Cнегопад',
    73: 'Снегопад',
    85: 'Снегопад',
    61: 'Дождь',
    45: 'Туман',
    80: 'Ливень',
    77: 'Град'
}

MOSCOW_LAT = 55.755864
MOSCOW_LON = 37.617698
